---
kind: property
id: P:Autodesk.Revit.UI.RevisionsOnSheetUIServiceData.IsReset
source: html/eeef55ad-a2a6-6de8-6beb-a3ee524f3bd5.htm
---
# Autodesk.Revit.UI.RevisionsOnSheetUIServiceData.IsReset Property

flag to indicate the value has been reset

## Syntax (C#)
```csharp
public bool IsReset { get; set; }
```